Repository: ayakakaa135-boop/sentiment_project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Sentiment Analysis
ar: تحليل المشاعر

source: Sentiment AI
ar: الذكاء الاصطناعي للمشاعر

source: Home
ar: الرئيسية

source: History
ar: السجل

source: Analytics
ar: التحليلات

source: Sentiment Analysis Platform
ar: منصة تحليل المشاعر

source: Powered by Machine Learning & Django
ar: مدعوم بتعلم الآلة و Django

source: History - Sentiment Analysis
ar: السجل - تحليل المشاعر

source: Prediction History
ar: سجل التوقعات

source: Track and review all your sentiment analyses
ar: تتبع ومراجعة جميع تحليلات المشاعر الخاصة بك

source: Total
ar: الإجمالي

source: Positive
ar: إيجابي

source: Negative
ar: سلبي

source: Neutral
ar: محايد

source: Filter by Sentiment
ar: تصفية حسب المشاعر

source: All
ar: الكل

source: No Predictions Yet
ar: لا توجد توقعات بعد

source: Start analyzing text to build your history
ar: ابدأ بتحليل النصوص لبناء سجلك

source: Analyze Text
ar: حلل النص

source: Back to Home
ar: العودة للرئيسية

source: Home - AI Sentiment Analysis
ar: الرئيسية - تحليل المشاعر بالذكاء الاصطناعي

source: AI-powered emotional intelligence for text
ar: ذكاء عاطفي مدعوم بالذكاء الاصطناعي للنصوص

source: Enter your text
ar: أدخل النص الخاص بك

source: Type or paste any text here...
ar: اكتب أو الصق أي نص هنا...

source: Analyze Sentiment
ar: حلل المشاعر

source: Try these examples:
ar: جرب هذه الأمثلة:

source: Arabic
ar: عربي

source: Instant
ar: فوري

source: <1s response
ar: استجابة أقل من ثانية

source: Accurate
ar: دقيق

source: Secure
ar: آمن

source: Private & Safe
ar: خاص وآمن

source: Result - Sentiment Analysis
ar: النتيجة - تحليل المشاعر

source: Analysis Complete
ar: اكتمل التحليل

source: Your Text
ar: النص الخاص بك

source: Confidence Score
ar: درجة الثقة

source: Analyze Another
ar: حلل نص آخر

source: View History
ar: عرض السجل
